import pandas as pd
from io import StringIO

data_string = """
timestamp_p,height,x_speed,y_speed,z_speed,pitch,roll,yaw,temperature,distance,barometer,flight_time,battery,mp_distance_x,mp_distance_y,mp_distance_z,class,,,,,,,,,,,,,,,,,,,,,
28123.02875,80,0,0,0,0,0,0,68,84,19309,7,65,-15,-5,86,benign
28123.55962,80,0,0,0,0,0,0,68,84,19305,7,65,-13,-6,86,benign
28124.0769,80,0,0,0,0,0,0,68,83,19303,8,65,-18,-6,85,benign
28124.602,80,0,0,0,-1,0,0,67,83,19307,8,65,-21,-9,84,benign
28125.1291,80,0,0,0,-1,0,0,67,85,19309,9,65,-24,-10,84,benign
28125.6552,80,0,0,0,-1,0,0,68,85,19306,9,65,-25,-10,85,benign
28126.17095,80,0,0,0,-1,0,0,68,85,19305,10,65,-26,-15,84,benign
28126.68745,80,1,0,0,-3,-1,0,68,84,19302,10,65,-25,-11,85,benign
28127.21861,80,1,0,0,-1,0,0,68,82,19307,11,65,-21,-6,83,benign
28127.76447,80,1,0,0,0,0,0,68,80,19309,11,65,-13,-4,82,benign
28128.28109,70,1,0,0,-1,0,0,68,79,19299,12,65,-12,-3,82,benign
22615.81999,70,0,0,0,0,0,0,62,84,13966,9,84,-15,-16,87,DoS
22616.34984,60,0,0,0,0,-1,0,61,83,13959,9,84,-16,-19,86,DoS
22616.88042,60,0,0,0,0,-1,0,61,83,13956,10,84,-17,-21,85,DoS
22617.41126,60,0,0,0,-1,0,0,62,83,13969,10,84,-16,-20,85,DoS
22617.94091,60,0,0,0,-1,0,0,62,82,13962,11,84,-14,-21,85,DoS
22618.46103,60,0,-1,0,-2,-3,0,62,83,13966,11,84,-19,-22,84,DoS
22618.98076,60,0,-1,0,0,-1,0,62,81,13959,12,84,-11,-17,84,DoS
22619.49795,60,0,-1,0,0,-1,0,62,81,13955,12,84,-10,-11,84,DoS
22620.02408,60,0,-1,0,-1,-1,0,62,81,13956,13,84,-6,-8,84,DoS
"""

# 使用StringIO将字符串数据转换为可读取的形式
data = pd.read_csv(StringIO(data_string))

# 现在data是一个DataFrame，你可以直接对其进行操作
print(data.head())  # 打印前五行以确认数据已正确加载

# 查看DataFrame的前几行来确认数据加载正确
print(data.head())


# 计算平均值
benign_mean = data[data["class"] == "benign"][
    ["temperature", "battery", "flight_time", "mp_distance_x"]
].mean()
dos_mean = data[data["class"] == "DoS"][
    ["temperature", "battery", "flight_time", "mp_distance_x"]
].mean()

print("Benign Mean:\n", benign_mean)
print("DoS Mean:\n", dos_mean)
